In [1]:
import camelot as cm

In [3]:
import_pdf = cm.read_pdf("india_factsheet_economic_n_hdi.pdf", flavor='lattice', pages= '1,2')

In [4]:
import_pdf

In [6]:
for t in import_pdf:
    print(t)

<Table shape=(4, 3)>
<Table shape=(15, 3)>
<Table shape=(14, 4)>
<Table shape=(13, 3)>

In [7]:
import_pdf[2].df

,0,1,2,3
0,Human Development Indicators,,2000,2011
1,13,Human Development Index Value (HDI),0.461,0.547
2,14,HDI Rank (out of 187),,134
3,15,Inequality Adjusted Human Development Index Value,,0.392
4,16,Loss in HDI due to Inequalities (%),,28.7
5,,,2001,2011
6,17,Gender Inequality Index (GII),0.5531,0.617
7,18,GII Rank (out of 146),,129
8,,,1996,2006
9,19,Gender Empowerment Measure (GEM),0.416,0.497
10,,,2001,2011
11,20,Literacy Rate (%),64.8,74.04
12,21,Male Literacy Rate (%),75.3,82.14
13,22,Female Literacy Rate (%),53.7,65.46

In [8]:
df = import_pdf[2].df.loc[11:14,1:3]

In [9]:
df

                           1     2      3
11         Literacy Rate (%)  64.8  74.04
12    Male Literacy Rate (%)  75.3  82.14
13  Female Literacy Rate (%)  53.7  65.46

In [11]:
df = df.reset_index(drop = True)

In [12]:
df

                          1     2      3
0         Literacy Rate (%)  64.8  74.04
1    Male Literacy Rate (%)  75.3  82.14
2  Female Literacy Rate (%)  53.7  65.46

In [13]:
df.columns = ['KPI', '2001','2011']

In [14]:
df

                        KPI  2001   2011
0         Literacy Rate (%)  64.8  74.04
1    Male Literacy Rate (%)  75.3  82.14
2  Female Literacy Rate (%)  53.7  65.46

In [17]:
df.loc[:,['2001','2011']] = df.loc[:,['2001','2011']].astype(float)

In [18]:
df

                        KPI  2001   2011
0         Literacy Rate (%)  64.8  74.04
1    Male Literacy Rate (%)  75.3  82.14
2  Female Literacy Rate (%)  53.7  65.46

In [19]:
df.to_csv('table_from_pdf.csv')

In [21]:
df.to_excel('table_from_pdf.xlsx')

In [22]:
ls

'Extracting table from PDF.ipynb'     main.tar.gz          table_from_pdf.xlsx
 india_factsheet_economic_n_hdi.pdf   table_from_pdf.csv   XlsxWriter-main/

In [23]:
import pandas as pd

In [25]:
import seaborn as sns